URL_PATTERNS = [
    r'https?://\S+',
    r'www\.\S+',
    r'\S+\.(ru|com|net|org|info|biz|io|me|su|рф)\b',

    r't\.me/\S+',
    r'\b(?:https?\s*:\s*/\s*/\s*)?\s*t\s*\.\s*me\s*/\S+',

    r'vk\.com/\S+', 
    r'\b(?:https?\s*:\s*/\s*/\s*)?\s*vk\s*\.\s*com\s*/\S+',

    r'ok\.ru/\S+',
    r'\b(?:https?\s*:\s*/\s*/\s*)?\s*ok\s*\.\s*ru\s*/\S+',

    r'youtube\.com/\S+',
    r'youtu\.be/\S+',
    r'\b(?:https?\s*:\s*/\s*/\s*)?\s*(youtube|youtu)\s*\.\s*(com|be)\s*/\S+',

    r'wa\.me/\S+',
    r'\b(?:https?\s*:\s*/\s*/\s*)?\s*wa\s*\.\s*me\s*/\S+',

    r'instagram\.com/\S+',
    r'\b(?:https?\s*:\s*/\s*/\s*)?\s*instagram\s*\.\s*com\s*/\S+',

    r'tiktok\.com/\S+',
    r'\b(?:https?\s*:\s*/\s*/\s*)?\s*tiktok\s*\.\s*com\s*/\S+',

    r'discord\.gg/\S+',
    r'discord\.com/invite/\S+',
    r'\b(?:https?\s*:\s*/\s*/\s*)?\s*discord\s*\.\s*(gg|com)\s*/\S+',
]

EXTRA_BAD_WORDS = [
    "бля", "блядь", "пизда", "ебал", "еблан", "хуесос", "хуи", "хуй",
    "мудак", "сука", "чмо", "гандон",

    "vk", "вк", "вконтакте", "тг", "телега", "телеграм", "ок", "одноклассники",
    "yt", "youtube", "insta", "инста", "тт", "тикток", "discord", "дискорд",
    "wa", "ватсап", "whatsapp", "instagram", "tiktok", "youtube", "telegram",

    "vк", "вК", "vконтакте", "тg", "тЕлЕгА", "инстА", "иnstА",
    "dискорд", "yоutubе", "tiktok", "тg", "whatsapp", "тeлeгрaм", "yоutubе",
    "иnstа", "VК", "tМе", "oк", "оdноклассники",

    "нарк", "наркотик", "порошок", "кокс", "героин", "шишка", "травка", "трамадол", "каннабис",
    "марихуана", "weed", "синтетика", "спайс", "меф", "экстази", "психотроп", "крам", "димедрол",

    "алкоголь", "пиво", "вино", "шампанское", "водка", "похмелье", "бутылка", "рюмка", "медовуха",
    "спирт", "самогон", "коктейль", "глоток", "хмель", "хмельной", "бухать", "похмеляться",

    "сигарета", "сигареты", "кальян", "табак", "картель", "никотин", "электронка", "вейп", "курить",

    "порнография", "порно", "фапать", "мастурбировать", "жопа", "сиськи", "сосать", "глотать", "минет",
    "отсосать", "ебаться", "секс", "ебло", "трахать", "трахнуться", "минет", "соска", "глотка",

    "б*я", "бля*", "бля#д", "пиз#д", "п**з", "е**а", "е*л", "ху**", "х*й", "хуй*", "муд@",
    "с**к", "чм@о", "г@нд", "шиш*ка", "т*вка", "кокс*", "экс*тази", "сигар*та", "в**ка", "вк*",
    "т*г", "тг*", "н@рк", "н@рк*т", "кок**", "с*к", "с@к", "с**ть", "секс*", "п@рн*",
    "сос*т", "фап*ть", "мин*т", "трах*ться", "глот*к", "инс**та", "инст*грам", "спай*с", "похм*л*е",
    "бот*ла", "п*хмелье", "т*рамадол", "м*ф", "е*бать", "еб*ться", "чмо*",
    
    "тг*", "тЕлЕгА", "wh@tsapp", "y*tube", "d*ск**д", "v*к", "инст*грам", "спай*с", "м@р*хуа**",
    "с*пейс", "к@кс", "шиш**", "трам@дол", "фап*", "карт*ль", "в**п", "с*нт@тик", "д@токс", "т*рахать"
]

CHAR_REPLACEMENTS = {
    'а': ['а', 'a', '@'],
    'б': ['б', '6', 'b'],
    'в': ['в', 'b', 'v'],
    'г': ['г', 'r', 'g'],
    'д': ['д', 'd'],
    'е': ['е', 'e'],
    'ё': ['ё', 'e'],
    'ж': ['ж', 'zh', '*'],
    'з': ['з', '3', 'z'],
    'и': ['и', 'u', 'i'],
    'й': ['й', 'u', 'i'],
    'к': ['к', 'k', 'i{', '|{'],
    'л': ['л', 'l', 'ji'],
    'м': ['м', 'm'],
    'н': ['н', 'h', 'n'],
    'о': ['о', 'o', '0'],
    'п': ['п', 'n', 'p'],
    'р': ['р', 'r', 'p'],
    'с': ['с', 'c', 's'],
    'т': ['т', 'm', 't'],
    'у': ['у', 'y', 'u'],
    'ф': ['ф', 'f'],
    'х': ['х', 'x', 'h', '}{'],
    'ц': ['ц', 'c', 'u,'],
    'ч': ['ч', 'ch'],
    'ш': ['ш', 'sh'],
    'щ': ['щ', 'sch'],
    'ь': ['ь', 'b'],
    'ы': ['ы', 'bi'],
    'ъ': ['ъ'],
    'э': ['э', 'e'],
    'ю': ['ю', 'io'],
    'я': ['я', 'ya']
}