ONES = [
    {
        "о": {
            "ч": {"и": "ноль", "р": "ноля", "д": "нолю", "в": "ноль", "т": "нолём", "п": "ноле"}
        }
    },
    {
        "м": {
            "е": {"и": "один", "р": "одного", "д": "одному", "в": "один", "т": "одним", "п": "одном"},
            "м": {"и": "одни", "р": "одних", "д": "одним", "в": "одних", "т": "одними", "п": "одних"}
        },
        "ж": {
            "е": {"и": "одна", "р": "одной", "д": "одной", "в": "одну", "т": "одной", "п": "одной"},
            "м": {"и": "одни", "р": "одних", "д": "одним", "в": "одних", "т": "одними", "п": "одних"}
        },
        "с": {
            "е": {"и": "одно", "р": "одного", "д": "одному", "в": "одно", "т": "одним", "п": "одном"},
            "м": {"и": "одни", "р": "одних", "д": "одним", "в": "одних", "т": "одними", "п": "одних"}
        }
    },
    {
        "м": {
            "ч": {"и": "два", "р": "двух", "д": "двум", "в": "два", "т": "двумя", "п": "двух"},
        },
        "ж": {
            "ч": {"и": "две", "р": "двух", "д": "двум", "в": "две", "т": "двумя", "п": "двух"}
        },
        "с": {
            "ч": {"и": "два", "р": "двух", "д": "двум", "в": "два", "т": "двумя", "п": "двух"},
        }
    },
    {
        "о": {
            "ч": {"и": "три", "р": "трёх", "д": "трём", "в": "три", "т": "тремя", "п": "трёх"}
        }
    },
    {
        "о": {
            "ч": {"и": "четыре", "р": "четырёх", "д": "четырём", "в": "четыре", "т": "четырьмя", "п": "четырёх"}
        }
    },
    {
        "о": {
            "ч": {"и": "пять", "р": "пяти", "д": "пяти", "в": "пять", "т": "пятью", "п": "пяти"}
        }
    },
    {
        "о": {
            "ч": {"и": "шесть", "р": "шести", "д": "шести", "в": "шесть", "т": "шестью", "п": "шести"}
        }
    },
    {
        "о": {
            "ч": {"и": "семь", "р": "семи", "д": "семи", "в": "семь", "т": "семью", "п": "семи"}
        }
    },
    {
        "о": {
            "ч": {"и": "восемь", "р": "восьми", "д": "восьми", "в": "восемь", "т": "восемью", "п": "восьми"}
        }
    },
    {
        "о": {
            "ч": {"и": "девять", "р": "девяти", "д": "девяти", "в": "девять", "т": "девятью", "п": "девяти"}
        }
    }
]

TEENS = [
    {
        "о": {
            "ч": {"и": "десять", "р": "десяти", "д": "десяти", "в": "десять", "т": "десятью", "п": "десяти"}
        }
    },
    {
        "о": {
            "ч": {"и": "одиннадцать", "р": "одиннадцати", "д": "одиннадцати", "в": "одиннадцать",
                  "т": "одиннадцатью", "п": "одиннадцати"}
        }
    },
    {
        "о": {
            "ч": {"и": "двенадцать", "р": "двенадцати", "д": "двенадцати", "в": "двенадцать",
                  "т": "двенадцатью", "п": "двенадцати"}
        }
    },
    {
        "о": {
            "ч": {"и": "тринадцать", "р": "тринадцати", "д": "тринадцати", "в": "тринадцать",
                  "т": "тринадцатью", "п": "тринадцати"}
        }
    },
    {
        "о": {
            "ч": {"и": "четырнадцать", "р": "четырнадцати", "д": "четырнадцати", "в": "четырнадцать",
                  "т": "четырнадцатью", "п": "четырнадцати"}
        }
    },
    {
        "о": {
            "ч": {"и": "пятнадцать", "р": "пятнадцати", "д": "пятнадцати", "в": "пятнадцать",
                  "т": "пятнадцатью", "п": "пятнадцати"}
        }
    },
    {
        "о": {
            "ч": {"и": "шестнадцать", "р": "шестнадцати", "д": "шестнадцати", "в": "шестнадцать",
                  "т": "шестнадцатью", "п": "шестнадцати"}
        }
    },
    {
        "о": {
            "ч": {"и": "семнадцать", "р": "семнадцати", "д": "семнадцати", "в": "семнадцать",
                  "т": "семнадцатью", "п": "семнадцати"}
        }
    },
    {
        "о": {
            "ч": {"и": "восемнадцать", "р": "восемнадцати", "д": "восемнадцати", "в": "восемнадцать",
                  "т": "восемнадцатью", "п": "восемнадцати"}
        }
    },
    {
        "о": {
            "ч": {"и": "девятнадцать", "р": "девятнадцати", "д": "девятнадцати", "в": "девятнадцать",
                  "т": "девятнадцатью", "п": "девятнадцати"}
        }
    }
]

TENS = [
    {
        "о": {
            "ч": {"и": "двадцать", "р": "двадцати", "д": "двадцати", "в": "двадцать",
                  "т": "двадцатью", "п": "двадцати"}
        }
    },
    {
        "о": {
            "ч": {"и": "тридцать", "р": "тридцати", "д": "тридцати", "в": "тридцать",
                  "т": "тридцатью", "п": "тридцати"}
        }
    },
    {
        "о": {
            "ч": {"и": "сорок", "р": "сорока", "д": "сорока", "в": "сорок", "т": "сорока", "п": "сорока"}
        }
    },
    {
        "о": {
            "ч": {"и": "пятьдесят", "р": "пятидесяти", "д": "пятидесяти", "в": "пятьдесят",
                  "т": "пятьюдесятью", "п": "пятидесяти"}
        }
    },
    {
        "о": {
            "ч": {"и": "шестьдесят", "р": "шестидесяти", "д": "шестидесяти", "в": "шестьдесят",
                  "т": "шестьюдесятью", "п": "шестидесяти"}
        }
    },
    {
        "о": {
            "ч": {"и": "семьдесят", "р": "семидесяти", "д": "семидесяти", "в": "семьдесят",
                  "т": "семьюдесятью", "п": "семидесяти"}
        }
    },
    {
        "о": {
            "ч": {"и": "восемьдесят", "р": "восьмидесяти", "д": "восьмидесяти", "в": "восемьдесят",
                  "т": "восемьюдесятью", "п": "восьмидесяти"}
        }
    },
    {
        "о": {
            "ч": {"и": "девяносто", "р": "девяноста", "д": "девяноста", "в": "девяносто",
                  "т": "девяноста", "п": "девяноста"}
        }
    }
]

HUNDREDS = [
    {
        "о": {
            "ч": {"и": "сто", "р": "ста", "д": "ста", "в": "сто", "т": "ста", "п": "ста"}
        }
    },
    {
        "о": {
            "ч": {"и": "двести", "р": "двухсот", "д": "двумстам", "в": "двести", "т": "двумястами", "п": "двухстах"}
        }
    },
    {
        "о": {
            "ч": {"и": "триста", "р": "трёхсот", "д": "трёмстам", "в": "триста", "т": "тремястами", "п": "трёхстах"}
        }
    },
    {
        "о": {
            "ч": {"и": "четыреста", "р": "четырёхсот", "д": "четырёмстам", "в": "четыреста",
                  "т": "четырьмястами", "п": "четырёхстах"}
        }
    },
    {
        "о": {
            "ч": {"и": "пятьсот", "р": "пятисот", "д": "пятистам", "в": "пятьсот", "т": "пятьюстами", "п": "пятистах"}
        }
    },
    {
        "о": {
            "ч": {"и": "шестьсот", "р": "шестисот", "д": "шестистам", "в": "шестьсот",
                  "т": "шестьюстами", "п": "шестистах"}
        }
    },
    {
        "о": {
            "ч": {"и": "семьсот", "р": "семисот", "д": "семистам", "в": "семьсот", "т": "семьюстами", "п": "семистах"}
        }
    },
    {
        "о": {
            "ч": {"и": "восемьсот", "р": "восьмисот", "д": "восьмистам", "в": "восемьсот",
                  "т": "восемьюстами", "п": "восьмистах"}
        }
    },
    {
        "о": {
            "ч": {"и": "девятьсот", "р": "девятисот", "д": "девятистам", "в": "девятьсот",
                  "т": "девятьюстами", "п": "девятистах"}
        }
    }
]

LEVELS = [
    {
        "о": {
            "е": {"и": "тысяча", "р": "тысячи", "д": "тысяче", "в": "тысячу", "т": "тысячей", "п": "тысяче"},
            "м": {"и": "тысячи", "р": "тысяч", "д": "тысячам", "в": "тысячи", "т": "тысячами", "п": "тысячах"}
        }
    },
    {
        "о": {
            "е": {"и": "миллион", "р": "миллиона", "д": "миллиону", "в": "миллион",
                  "т": "миллионом", "п": "миллионе"},

            "м": {"и": "миллионы", "р": "миллионов", "д": "миллионам", "в": "миллионы",
                  "т": "миллионами", "п": "миллионах"}
        }
    },
    {
        "о": {
            "е": {"и": "миллиард", "р": "миллиарда", "д": "миллиарду", "в": "миллиард",
                  "т": "миллиардом", "п": "миллиарде"},

            "м": {"и": "миллиарды", "р": "миллиардов", "д": "миллиардам", "в": "миллиарды",
                  "т": "миллиардами", "п": "миллиардах"}
        }
    }
]

CASE_LIST = ["и", "р", "д", "в", "т", "п"]

GENDER_LIST = ["м", "с", "ж"]

SCALE = 4 #Глубина перевода, сколько максимум триплетов будет обработано
